# 프로그래머스 문제 풀이 - 주사위 게임 1 (181839)

## 문제 정보
# **문제 이름**: 주사위 게임 1
# **문제 번호**: 181839
# **링크**: [링크](https://programmers.co.kr/learn/courses/30/lessons/181839)
# **풀이 날짜** : 2024-11-07

## 문제 
# 문제 설명 :
# 1부터 6까지 숫자가 적힌 주사위가 두 개 있습니다. 두 주사위를 굴렸을 때 나온 숫자를 각각 a, b라고 했을 때 얻는 점수는 다음과 같습니다.
#
# a와 b가 모두 홀수라면 a^2 + b^2 점을 얻습니다.
# a와 b 중 하나만 홀수라면 2 × (a + b) 점을 얻습니다.
# a와 b 모두 홀수가 아니라면 |a - b| 점을 얻습니다.
# 두 정수 a와 b가 매개변수로 주어질 때, 얻는 점수를 return 하는 solution 함수를 작성해 주세요.

## 코드
def solution(a, b):
    if a % 2 and b % 2 :
        return a ** 2 + b ** 2
    elif a % 2 == 0 and b % 2 == 0 :
        return abs(a - b)
    else :
        return 2 * (a + b)
